import { GuideItemResponseType } from '../../types';

export const mockGuideItem: GuideItemResponseType = {
	id: 'e1bfd2d3-f0fb-470e-bdd3-be884fdd8dfb',
	title: '10 คาเฟ่ลับ One Bangkok!',
	socialTitle:
		'ไม่อยากจะเชื่อ มีร้านคาเฟ่ดี ๆ แบบนี้ห้างดังย่านลุมพินี One Bangkok ด้วย',
	shortDescription: 'รวมคาเฟ่เด็ดที่ One Bangkok',
	description:
		'รวมสุดยอดคาเฟ่ลับ ที่จะพาคุณไปหลงทาง เอ้ย! หลงไหล ในกลิ่นกาแฟอันหอมหวน และ บรรยากาศร้านติดแกรม กินแล้วจะติดใจ',
	coverPhoto: {
		id: '63ce2123-b49a-49cc-bc13-80ed802a7894',
		smallUrl: 'http://localhost:7777/r/854/480/20240902_091058.jpg',
		largeUrl: 'http://localhost:7777/r/1920/1080/20240902_091058.jpg',
	},
	tags: ['กาแฟ', 'คาเฟ่', 'กรุงเทพ', 'One', 'Bangkok'],
	writeDate: '2024-03-10T12:00:00.000Z',
	createdAt: '2024-03-10T12:00:00.000Z',
	updatedAt: '2024-03-10T12:00:00.000Z',
	items: [
		'c77c4d6c-01fa-4e62-8870-563de216a976',
		'a213d622-6649-45b2-9857-ce7f81581256',
		'fed2219f-6dc3-4191-a29d-dd1a15f524ee',
		'da79ad80-6cc0-484d-a574-a84151aba3ef',
		'0209bd16-ca21-4e7f-97e5-888dc20b2896',
		'3cef2b8f-e73e-40d4-9ca5-41fc5b15ca42',
		'9e4ae89a-fd31-4ee0-9378-1d52fb9609a1',
		'c4aa01b9-d123-411a-8b27-b3bf2e159250',
		'f5d95e8f-07c7-4aae-a900-0869ded5c96d',
		'aecd47a3-4e90-494a-afa2-86f0cb692fe9',
	],
};

export const mockGuideItem2: GuideItemResponseType = {
	id: '34c790dd-123b-499b-ba55-ea2f5befb452',
	title: 'พาส่องพิกัดร้านดัง One Bangkok ทั้งคาเฟ่&ร้านอาหาร',
	socialTitle:
		'พาส่อง! พิกัดลับร้านดัง One Bangkok คาเฟ่ & ร้านอาหารที่สายกินต้องไม่พลาด! 🍽️✨',
	shortDescription:
		'One Bangkok แหล่งรวมคาเฟ่ชิค ๆ และร้านอาหารสุดปัง ที่สายกินต้องมา! 🍽️✨ ตั้งแต่กาแฟหอมกรุ่น ครัวซองต์อบใหม่ อาหารไทยรสจัด ไปจนถึงไฟน์ไดนิ่งสุดหรู 🌆 อร่อยจนลืมคุมแคล~ ถ่ายรูปมุมไหนก็ปัง 📸💕 ระวังอย่างเดียว… กระเป๋าแฟบเพราะหยุดสั่งไม่ได้! 🤣💸',
	description:
		'พาส่องพิกัดลับที่ไม่ลับแต่เด็ดสุด! 🤩✨ One Bangkok ที่นี่ไม่ได้มีแค่ตึกสูง ๆ หรู ๆ แต่ยังเป็นแหล่งรวมคาเฟ่ชิค ๆ และร้านอาหารสุดปังที่สายกินอย่างเราต้องไม่พลาด! 🍽️ ไม่ว่าคุณจะเป็นสายกาแฟดริป สายครัวซองต์ สายอาหารไทยรสจัด หรือแม้แต่สายกินทุกอย่างที่ขวางหน้า (แบบเราเอง 😂) บอกเลยว่าที่นี่มีครบจบในที่เดียว! ☕🥐🍛 เดินเข้าไปแล้วสัมผัสได้ถึงกลิ่นหอมของกาแฟอบอวล~ 🏙️ ตามมาด้วยขนมอบใหม่จากเตา 🥖 และอาหารจานเด็ดที่เชฟใส่ใจสุด ๆ 🍣🔥 คือแค่เดินผ่านก็เหมือนโดนดึงดูดเข้าไปแบบไม่มีสิทธิ์ปฏิเสธ! ถ้าใครเป็นสายคาเฟ่ฮอปปิ้ง ที่นี่คือสวรรค์เลย เพราะแต่ละร้านตกแต่งมินิมอล น่านั่ง ถ่ายรูปขึ้นสุด ๆ 📸✨ ส่วนสายกินจริงจัง ไม่ต้องห่วง! 🥩🍜 ร้านอาหารระดับเชฟกระทะเหล็กก็มี! ตั้งแต่สตรีทฟู้ดอัปเกรด ไปจนถึงอาหารไฟน์ไดนิ่งหรู ๆ ที่มาพร้อมบรรยากาศดี ๆ วิวหลักล้าน 🌆 อาหารอร่อยจนลืมคุมแคล~ กินไปก่อน ค่อยลดพรุ่งนี้ก็ได้ 😆 และที่พีคคือ! ไม่ว่าคุณจะเป็นคนตื่นเช้า หรือชาวนอนดึก ที่นี่มีร้านเปิดตั้งแต่เช้ายันค่ำ บางร้านปิดดึกยันเที่ยงคืน 🍹🎶 จะมานั่งชิลล์ทำงาน 📖 หรือนัดเดอะแก๊งค์มากินดึก ๆ ก็ตอบโจทย์สุด! สรุปง่าย ๆ One Bangkok คือสวรรค์ของนักกิน 🏆💖 ถ้าใครยังไม่เคยไป ต้องรีบไปลอง! แต่ระวังอย่างเดียว… ระวังกระเป๋าแฟบ เพราะอร่อยทุกอย่างจนหยุดสั่งไม่ได้! 💸🤣',
	coverPhoto: {
		id: '55c4f986-7a9a-447f-8189-b2da1c8bed18',
		smallUrl:
			'http://localhost:7777/r/854/480/461096059_912589204236633_7378604821400958462_n.jpg',
		largeUrl:
			'http://localhost:7777/r/1920/1080/461096059_912589204236633_7378604821400958462_n.jpg',
	},
	tags: ['กาแฟ', 'คาเฟ่', 'ร้านอาหาร', 'กรุงเทพ', 'One', 'Bangkok'],
	writeDate: '2024-01-10T12:00:00.000Z',
	createdAt: '2024-01-10T12:00:00.000Z',
	updatedAt: '2024-01-10T12:00:00.000Z',
};
